     A* Logical file test
      *
     A          R PERSFMT4                  PFILE(PERSON)
     A            PERSONID                  TEXT('* TESTING...')
WASD A            FIRSTNAME
     A            LASTNAME
ADDDDA            AGE
     A          K PERSONID                  
     A          O AGE                       COMP(GT 30)
TEST A*