     A* Testing a physical file
     A*
     A* File from
     A*   http://www.go4as400.com/Source-physical-file-and-logical-file-in-as400/files.aspx?cid=4
     A
     A* File level
     A                           UNIQUE
     A* Record format level
     A          R ACCOUNT          
     A* Field level
     A            ACLEVELID      2P 0 
     A            ACORGCOD       3P 0
     A            ACCOUNTNUM    12P 0
     A            ACCURRENCY     3A
     A            ACNAME        20A
     A* Keyfield level
     A          K ACLEVELID
     A          K ACORGCOD
     A          K ACCOUNTNUM
     A          K ACCURRENCY
     A*