     A* Join logical file: JFILE, JOIN, JFLD, JREF.
     A* Member: LFJOIN   Compilable: yes (given PF1, PF2, PF3)
     A* Source: IBM i 7.5 Join logical files in DDS
     A*   ibm.com/docs/en/i/7.5?topic=files-join-logical-in-dds
     A* Retrieved: 2026-07-25
     A*
     A* Joins fields from two physical files into one record format.
     A* JFILE replaces PFILE and is required at the record level.
00010A          R RECORD1                   JFILE(PF1 PF2)
00020A          J                           JOIN(PF1 PF2)
00030A                                      JFLD(NAME NAME)
00040A            NAME                      JREF(1)
00050A            ADDR
00060A            PHONE
     A*
     A* JOIN is optional with two files, but one JOIN is required per
     A* secondary file when JFILE names more than two.
00070A          R RECORD2                   JFILE(PF1 PF2 PF3)
00080A          J                           JOIN(PF1 PF2)
00090A                                      JFLD(CUSTNO CUSTNO)
00100A          J                           JOIN(PF1 PF3)
00110A                                      JFLD(ITEMNO ITEMNO)
00120A            CUSTNO                    JREF(1)
00130A            CUSTNAME                  JREF(2)
00140A            ITEMDESC                  JREF(3)
     A*
     A* More than one join field may pair two files.
00150A          R RECORD3                   JFILE(PF1 PF2)
00160A          J                           JOIN(PF1 PF2)
00170A                                      JFLD(FIRSTNAME FIRSTNAME)
00180A                                      JFLD(LASTNAME LASTNAME)
00190A                                      JDUPSEQ(SEQFLD)
00200A            FIRSTNAME
00210A            LASTNAME
     A*
     A* JDFTVAL supplies default values for unmatched secondary
     A* records, producing a left outer join.
00220A                                      JDFTVAL
00230A          K LASTNAME
