     D* https://github.com/barrettotte/vscode-ibmi-languages/issues/110
      *
     D D_SPEC          C                   'D'
     D CL_START        C                   Const('SEQNBR  *...+... 1 ...+... 2')
     D CL_END          C                   Const('E N D   O F   S O U R C E')
     D*
     D* error caused by extended names in D spec
     D*
     D STREAM_NEW_LINE...                                                       xxxxxx
     D                 C                   X'15'
     D EVEN...                                                                  awdasasdasd
     D                 C                   X'15'
     D ODD...                                                                   asdasdasd
     D                 C                   X'15'
     D STREAM_NEW_LINX...                                                       xxxxxx
     D                 C                   X'15'
     D STREAM_LINE_FEED...
     D                 C                   X'25'
     D STREAM_CARRIAGE_RETURN...
     D                 C                   X'0D'