
RUNSQM REQUEST('SELECT * FROM QTEMP/RTVSRCF WHERE SUBSTR(SRCDTA, 6, 2)=''A '' AND SUBSTR(SRCDTA, 17, 1)=''R'' ') +
        OUTPUT(*OUTFILE) OUTFILE(QTEMP/RTVJOIN) MEMBER(*ADD/*FIRST)
MONMSG MSGID(CPF0000) EXEC(GOTO CMDLBL(SQLERRORE))
