**free

dcl-s @te@st@ char(16) inz(*blanks);
dcl-s #te#st# char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// note: double click doesn't select full identifier
//   but, single clicking highlights full identifier
// I guess that's the correct behavior?

// Additional variants: https://docs.google.com/spreadsheets/d/1J4yEGkfhtmACfdDVyD2XNJe0jjrIK77Um6-wsvW0etM/edit?usp=sharing

// CCSID 273 (Austria and Germany)
dcl-s @te@st@ char(16) inz(*blanks);
dcl-s §te§st§ char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// CCSID 277 (Denmark and Norway)
dcl-s ØteØstØ char(16) inz(*blanks);
dcl-s ÆteÆstÆ char(16) inz(*blanks);
dcl-s ÅteÅstÅ char(16) inz(*blanks);

// CCSID 278 (Finland and Sweden)
dcl-s ÖteÖstÖ char(16) inz(*blanks);
dcl-s ÄteÄstÄ char(16) inz(*blanks);
dcl-s ÅteÅstÅ char(16) inz(*blanks);

// CCSID 280 (Italy)
dcl-s §te§st§ char(16) inz(*blanks);
dcl-s £te£st£ char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// CCSID 284 (Spain and Latin America)
dcl-s @te@st@ char(16) inz(*blanks);
dcl-s ÑteÑstÑ char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// CCSID 285 (Ireland and the United Kingdom)
dcl-s @te@st@ char(16) inz(*blanks);
dcl-s #te#st# char(16) inz(*blanks);
dcl-s £te£st£ char(16) inz(*blanks);

// CCSID 290 (Japan (katakana))
dcl-s @te@st@ char(16) inz(*blanks);
dcl-s #te#st# char(16) inz(*blanks);
dcl-s ¥te¥st¥ char(16) inz(*blanks);

// CCSID 297 (France)
dcl-s àteàstà char(16) inz(*blanks);
dcl-s £te£st£ char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// CCSID 423 (Greece)
dcl-s §te§st§ char(16) inz(*blanks);
dcl-s £te£st£ char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// CCSID 871 (Iceland)
dcl-s ÐteÐstÐ char(16) inz(*blanks);
dcl-s #te#st# char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// CCSID 905 (Turkey - Latin-3)
dcl-s ŞteŞstŞ char(16) inz(*blanks);
dcl-s ÖteÖstÖ char(16) inz(*blanks);
dcl-s İteİstİ char(16) inz(*blanks);
