**free

dcl-s @te@st@ char(16) inz(*blanks);
dcl-s #te#st# char(16) inz(*blanks);
dcl-s $te$st$ char(16) inz(*blanks);

// note: double click doesn't select full identifier
//   but, single clicking highlights full identifier
// I guess that's the correct behavior?
