      * https://github.com/barrettotte/vscode-ibmi-languages/issues/34
     ,*                                                                                     *INZSR
     C                   ENDSR                                                              *INZSR
      /EJECT                                                                                TPBFVR
      /COPY EQCPYLESRC,PSSR_B                    Program error control sub (on-line)     IL EQTPBFVR
      /EJECT                                                                                TPBFVR
      /COPY EQCPYLESRC,NUMEDT                    Edit number without leading zeros        C EQTPBFVR
     ,*---------------------------------------------------------------------------------------TPBFVR
