      *  https://github.com/barrettotte/vscode-ibmi-languages/issues/48
     IXYZ123    AC  40   62 C4
      *                        a
     I         OR   41   62 C5
      *                        b
     I         OR   42   62 C6
      *                        c
     I         OR   43   62 C7
      *                        d
     I         OR   44   62 C8
      *                        e