**free

  // https://github.com/barrettotte/vscode-ibmi-languages/issues/49
            
  for AL3Ptr = NameCount + 1 to 5;
    ReturnLine(AL3Ptr) = *blanks;
  endfor;