     A* https://github.com/barrettotte/vscode-ibmi-languages/issues/52
     A* 
     A
TEST A                                      UNIQUE
     A          R ACCOUNT                   TEXT('Record format text')
     A            ACCOUNTNUM    12P 0       TEXT('text')
     A            ACCURRENCY     3A         TEXT('text')
WASD A            ACNAME        20A         TEXT('text')
AHHHHA                                      COLHDG('Column' +
     A                                             'Heading' )
     A* Keys
     A          K ACCOUNTNUM
     A          K ACCURRENCY