**   COVERAGES ARRAY
MED EXP                      1
INC LOSS                     2
FUN EXP                      3
ACC DEATH                    4
COMB-FPB                     5
PIP LIMIT                    6
DED/INCOME                   7
SEC                          8
PIP DED                      9
PIP                         10
DEDUCTIBLE                  11
DED/CO-ORD                  12