      * https://github.com/barrettotte/vscode-ibmi-languages/issues/90
      *
     H/TITLE Test fixed

/FREE
  /TITLE Test free
  CTL-OPT DATFMT(*YMD) DATEDIT(*YMD) DEBUG(*YES);
/END-FREE
